Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void callbackCompressor(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    // url = getPGMString(urlPutCompressor);
    // urlString = String(url);
}

void callbackFlow(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackPump(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackLight(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    url = getPGMString(urlPutLight);
    urlString = String(url) + String(device.getObjectID().c_str());

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(device.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("%s состояние %s\n"), device.getName().c_str(), (device.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void callbackFeeder(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackCO2(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackHeater(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackDoser(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void initMediators() {
    medCompressor.Register("1", callbackCompressor);
    medFlow.Register("1", callbackFlow);
    medPump.Register("1", callbackPump);
    medLight.Register("1", callbackLight);
    medFeeder.Register("1", callbackFeeder);
    medCO2.Register("1", callbackCO2);
    medHeater.Register("1", callbackHeater);
    medDoser.Register("1", callbackDoser);
    // TODO добавить медиатор для прожекторов
}

void createDevicesAndScheduler() {
    Serial.printf_P(PSTR("++++++++createDevicesAndScheduler++++\n"));
    compressor = new Sensor(medCompressor, "Компрессор", Sensor::compressor);
    flow = new Sensor(medFlow, "Помпа течения", Sensor::flow);
    pump = new Sensor(medPump, "Помпа подъёмная", Sensor::pump);
    feeder = new Sensor(medFeeder, "Кормушка", Sensor::feeder);
    co2 = new Sensor(medCO2, "CO2", Sensor::co2);
    heater = new Sensor(medHeater, "Нагреватель", Sensor::heater);
    doserNew = new Sensor(medDoser, "Дозатор", Sensor::doser);
    Serial.println("---------------------");
    for (int i = 0; i < LIGHTS_COUNT; ++i) {
        std::string buffer = string_format("%s %d", "Прожектор", i + 1);
        auto item = lights.at(i);
        Serial.println("Before");
        Serial.println(item.getName().c_str());
        item.setName(buffer);
        Serial.println("After");
        Serial.println(item.getName().c_str());
        schedulesArray.at(i).setDevice(&item);
    }
     Serial.printf_P(PSTR("++++++++createDevicesAndScheduler++++\n"));
}

void printDevice(Sensor* device) {
    Serial.printf_P(PSTR("%s\n"), device->printDevice().c_str());
}

void printAllDevices() {
    printDevice(compressor);
    printDevice(flow);
    printDevice(pump);
    printDevice(feeder);
    printDevice(co2);
    printDevice(heater);
    printDevice(doserNew);
    for (auto light : lights) {
        printDevice(&light);
    }
}

float getSensorTemperature(const uint8_t* sensorAddress) {
    unsigned int rawData;
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0x44, 1);
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0xBE);
    for (uint8_t i = 0; i < 9; i++) {
        sensorData[i] = onewire.read();
    }
    rawData = (sensorData[1] << 8) | sensorData[0];
    float celsius = static_cast<float>(rawData) / static_cast<float>(16.0);
    return celsius;
}

void getSensorsTemperature() {
    sensorTemperatureValue1 = getSensorTemperature(sensorTemperatureAddress1);
    sensorTemperatureValue2 = getSensorTemperature(sensorTemperatureAddress2);
    Serial.printf_P(PSTR(" [T1: %s°]  [T2: %s°]\n"), String(sensorTemperatureValue1).c_str(),
                    String(sensorTemperatureValue2).c_str());
}

bool shouldRun(Sensor* lamp) {
    uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
    uint16_t minutesOn = lamp->getHourOn() * 60 + lamp->getMinuteOn();
    uint16_t minutesOff = lamp->getHourOff() * 60 + lamp->getMinuteOff();
    bool result;
    if ((minutes > minutesOn) && (minutes < minutesOff)) {
        result = true;
    } else {
        result = false;
    }
    return result;
}

void sendMessage(const String& message) {
    char* url = nullptr;
    char* ct = nullptr;
    char* att = nullptr;
    char* actitle = nullptr;
    char* actext = nullptr;
    char* aj = nullptr;
    url = getPGMString(urlPushMessage);
    aj = getPGMString(applicationJson);
    ct = getPGMString(contentType);
    att = getPGMString(androidTickerText);
    actitle = getPGMString(androidContentTitle);
    actext = getPGMString(androidContentText);
    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + message + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), F("Push Notifications are cool"));

