Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
}

void sendMessage(Sensor* device, bool state) {
    char dataMsg[100];
    String stateString = state ? "включение" : "выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "%s: %s", device->getName().c_str(), String(p).c_str());
    delPtr(p);

    char* url = nullptr;
    char* ct = nullptr;
    char* att = nullptr;
    char* actitle = nullptr;
    char* actext = nullptr;
    char* aj = nullptr;
    url = getPGMString(urlPushMessage);
    aj = getPGMString(applicationJson);
    ct = getPGMString(contentType);
    att = getPGMString(androidTickerText);
    actitle = getPGMString(androidContentTitle);
    actext = getPGMString(androidContentText);

    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + stateString + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), String(dataMsg));
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("  Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
    stateString.clear();
}

AlarmID_t findAlarmByDevice(Sensor* device, bool isOn) {
    AlarmID_t result = -1;
    for (auto scheduleItem : schedulesArray) {
        auto deviceToFind = scheduleItem.getDevice();
        if (device == deviceToFind) {
            result = isOn ? scheduleItem.getOn() : scheduleItem.getOff();
            break;
        }
    }
    return result;
}

void deviceOnHandler(Sensor* device) {
    if (device->getEnabled()) {
        Serial.printf_P(PSTR("  %s: включение, pin %d\n"), device->getName().c_str(), device->getPin());
        shiftRegister.setPin(countShiftRegister, device->getPin(), HIGH);
        sendMessage(device, true);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setState(true);
        device->setStateNotify(true);
    } else {
        Serial.printf_P(PSTR("  %s %s\n"), device->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void deviceOffHandler(Sensor* device) {
    if (device->getEnabled()) {
        Serial.printf_P(PSTR("  %s: выключение, pin %d\n"), device->getName().c_str(), device->getPin());
        shiftRegister.setPin(countShiftRegister, device->getPin(), LOW);
        sendMessage(device, false);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setState(false);
        device->setStateNotify(false);
    } else {
        Serial.printf_P(PSTR("  %s %s\n"), device->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void doserHandler(const doser& dos) {
    String message;
    message = "Включение дозатора " + dos.name;
    sendMessage(message);
    message.clear();

    switch (dos.type) {
        case K:
            doserK->begin();
            doserK->setEnableActiveState(LOW);
            doserK->move(dos.steps);
            doserK->setEnableActiveState(HIGH);
            break;
        case NP:
            doserNP->begin();
            doserNP->setEnableActiveState(LOW);
            doserNP->move(dos.steps);
            doserNP->setEnableActiveState(HIGH);
            break;
        case Fe:
            doserFe->begin();
            doserFe->setEnableActiveState(LOW);
            doserFe->move(dos.steps);
            doserFe->setEnableActiveState(HIGH);
            break;
        default:
            break;
    }
}

void splitTime(char* payload, uint8_t& hour, uint8_t& minute) {
    char* split = strtok(payload, ":");
    char* pEnd;
    hour = strtol(split, &pEnd, 10);
    split = strtok(nullptr, ":");
    minute = strtol(split, &pEnd, 10);
}

void parseJSONLights(const String& response) {
    Serial.println("parseJSONLights");
    DynamicJsonDocument doc(2000);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string name = obj["name"];
            const char* off = obj["off"];
            const char* on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];

            char* dupOn = strdup(on);
            char* dupOff = strdup(off);
            for (auto&& device : lights) {
                // if (strcmp(name, device.getName().c_str()) == 0) {
                //Сравниваем предустановленное имя с результатом из JSON ответа от сервера
                Serial.print("name=");
                Serial.println(name.c_str());
                Serial.print("device.getName()=");
                Serial.println(device.getName().c_str());

                if (name == device.getName()) {
                    device.setState(state);
                    device.setEnabled(enabled);
                    device.setPin(pin);
                    device.setObjectID(objectId);
                    device.setTimeOn(dupOn);
                    device.setTimeOff(dupOff);

                    for (auto& i : schedulesArray) {
                        auto deviceItem = i.getDevice();
                        auto schedulerItem = i;
                        if (name == deviceItem->getName()) {
                            Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"),
                                            i.getDevice()->getHourOn(), i.getDevice()->getMinuteOn(), i.getDevice()->getHourOff(),
                                            i.getDevice()->getMinuteOff(), (i.getDevice()->getState() ? "включен" : "выключен"),
                                            (i.getDevice()->getEnabled() ? "да" : "нет"), i.getDevice()->getPin());

                            auto alarmOn = Alarm.alarmRepeat(deviceItem->getHourOn(), deviceItem->getMinuteOn(), 0, deviceOnHandler,
                                                             deviceItem);
                            auto alarmOff = Alarm.alarmRepeat(deviceItem->getHourOff(), deviceItem->getMinuteOff(), 0,
                                                              deviceOffHandler, deviceItem);
                            schedulerItem.setOn(alarmOn);
                            schedulerItem.setOff(alarmOff);

                            if (shouldRun(deviceItem)) {
                                deviceOnHandler(deviceItem);
                            } else {
                                deviceOffHandler(deviceItem);
                            }
                        }
                    }
                    break;
                }
            }
            free(dupOn);
            free(dupOff);
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONDosers(const String& response) {
    std::unique_ptr<GBasic> emptyDoser{};
    uint8_t dosersCount = (sizeof(dosersArray) / sizeof(*dosersArray));
    uint8_t ind = 0;
    DynamicJsonDocument doc(1300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F("parseJSONDosers -> Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            // TODO добавить флаг доступности работы дозатора
            uint8_t dirPin = obj["dirPin"];
            uint8_t stepPin = obj["stepPin"];
            uint8_t enablePin = obj["enablePin"];
            uint8_t sleepPin = obj["sleepPin"];
            uint8_t mode0_pin = obj["mode0_pin"];
            uint8_t mode1_pin = obj["mode1_pin"];
            uint8_t mode2_pin = obj["mode2_pin"];

            uint8_t index = obj["index"];
            uint16_t steps = obj["steps"];
            uint16_t volume = obj["volume"];
            const char* name = obj["name"];
            const char* time = obj["time"];

            char* dupTime = strdup(time);
            for (auto& doserItem : dosersArray) {
                if (strcmp(name, doserItem.name.c_str()) == 0) {
                    for (size_t k = 0; k < dosersCount; k++) {
                        if (dosersArray[k].type == doserItem.type) {
                            ind = k;
                            k = dosersCount;
                        }
                    }
                    dosersArray[ind].dirPin = dirPin;
                    dosersArray[ind].stepPin = stepPin;
                    dosersArray[ind].enablePin = enablePin;
                    dosersArray[ind].sleepPin = sleepPin;
                    dosersArray[ind].mode0_pin = mode0_pin;
                    dosersArray[ind].mode1_pin = mode1_pin;
                    dosersArray[ind].mode2_pin = mode2_pin;

                    dosersArray[ind].index = index;
                    dosersArray[ind].steps = steps;
                    dosersArray[ind].volume = volume;

                    splitTime(dupTime, dosersArray[ind].hour, dosersArray[ind].minute);
#ifdef ARDUINO_ARCH_ESP32
                    emptyDoser = std_esp32::make_unique<GBasic>(dosersArray[ind].steps, dosersArray[ind].dirPin,
                                                                dosersArray[ind].stepPin, dosersArray[ind].enablePin,
                                                                dosersArray[ind].mode0_pin, dosersArray[ind].mode1_pin,
                                                                dosersArray[ind].mode2_pin, shiftRegister, dosersArray[ind].index);
#else
                    emptyDoser =
                        std::make_unique<GBasic>(dosersArray[ind].steps, dosersArray[ind].dirPin, dosersArray[ind].stepPin,
                                                 dosersArray[ind].enablePin, dosersArray[ind].mode0_pin, dosersArray[ind].mode1_pin,
                                                 dosersArray[ind].mode2_pin, shiftRegister, dosersArray[ind].index);
#endif
                    switch (doserItem.type) {
                        case K:
                            doserK = std::move(emptyDoser);
                            break;
                        case NP:
                            doserNP = std::move(emptyDoser);
                            break;
                        case Fe:
                            doserFe = std::move(emptyDoser);
                            break;
                        default:
                            Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора", ToString(doserItem.type));
                            break;
                    }
                    dosersArray[ind].alarm =
                        Alarm.alarmRepeat(dosersArray[ind].hour, dosersArray[ind].minute, 0, doserHandler, dosersArray[ind]);
                    // TODO Селать проверку на было ли уже событие в текущем дне
                    break;
                }
            }
            free(dupTime);
        }
        doc.shrinkToFit();
        doc.clear();
    }
}
/*
void parseJSONCompressor(const String& response) {
    DynamicJsonDocument doc(300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F("parseJSONCompressor -> Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            const char* off = obj["off"];
            const char* on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            char* dupOn = strdup(on);
            char* dupOff = strdup(off);

            for (auto&& device : devicesArray) {
                if (device.getType() == Device::Compressor) {
                    device.setState(state);
                    device.setEnabled(enabled);
                    device.setPin(pin);
                    device.setTimeOn(dupOn);
                    device.setTimeOff(dupOff);
                    for (auto& i : schedulesArray) {
                        auto deviceItem = i.getDevice();
                        auto schedulerItem = i;
                        Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"),
                                        i.getDevice()->getHourOn(), i.getDevice()->getMinuteOn(), i.getDevice()->getHourOff(),
                                        i.getDevice()->getMinuteOff(), (i.getDevice()->getState() ? "включен" : "выключен"),
                                        (i.getDevice()->getEnabled() ? "да" : "нет"), i.getDevice()->getPin());

