Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        );
    }
}

void printDosersParam() {
    Serial.printf_P(PSTR("%s\n"), "Настройки дозаторов");
    for (auto& doser : dosersArray) {
        Serial.printf_P(
            PSTR("%d => %s: Вкл %02d:%02d. Pins: dir=%d step=%d enable=%d sleep=%d.\nОбъём: %d. Modes:%d.%d.%d Steps:%d\n"),
            doser.index, doser.name.c_str(), doser.hour, doser.minute, doser.dirPin, doser.stepPin, doser.enablePin, doser.sleepPin,
            doser.volume, doser.mode0_pin, doser.mode1_pin, doser.mode2_pin, doser.steps);
    }
}

void printParams() {
    printLights();
    printDosersParam();
}

void timer1() {
    char* df = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Время %s\n"), String(df).c_str());

    free(df);
    getSensorsTemperature();

    if (getUpdateSettings()) {
        Serial.printf_P(PSTR("%s\n"), "Будет выполнено обновление всех параметров");
        getParamsBackEnd();
        printParams();
        putUpdateSettings();
    }
}

String serializeTemperature() {
    String output;
    const int capacity = JSON_OBJECT_SIZE(5);
    DynamicJsonDocument doc(capacity);
    char* currentTime = clockRTC.dateFormat("d.m.Y H:i:s", clockRTC.getDateTime());
    String time = String(currentTime);

    doc["sensor1"] = static_cast<double>(sensorTemperatureValue1);
    doc["Sensor"] = static_cast<double>(sensorTemperatureValue2);
    doc["time"] = time;
    serializeJson(doc, output);
    delPtr(currentTime);
    return output;
}

void sendTemperature() {
    char* urlPost = getPGMString(urlPostTemperature);
    char* urlPut = getPGMString(urlPutTemperature);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    String payload = serializeTemperature();
    String urlPostString = String(urlPost);
    String urlPutString = String(urlPut);
    String ctString = String(ct);
    String ajString = String(aj);

    if (https.begin(*client, urlPostString)) {
        https.addHeader(ctString, ajString);
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Значения датчиков температуры отправлены"));
        } else {
            Serial.printf_P(PSTR("postTemperature() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s\n"), "postTemperature() -> Невозможно подключиться\n");
    }
    https.end();
    urlPostString.clear();

    if (https.begin(*client, urlPutString)) {
        https.addHeader(ctString, ajString);
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putTemperature() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s\n"), "putTemperature() -> Невозможно подключиться\n");
    }
    https.end();
    payload.clear();
    urlPutString.clear();
    ctString.clear();
    ajString.clear();

    delPtr(ct);
    delPtr(aj);
    delPtr(urlPost);
    delPtr(urlPut);
}

void timer5() {
    uptime();
    lastOnline();
    getSensorsTemperature();
    sendTemperature();
}

void startTimers() {
    Serial.printf_P(PSTR("%s %d\n"), "Кол-во таймеров", Alarm.count());
    Alarm.timerRepeat(5 * 60, timer5);
    Alarm.timerRepeat(60, timer1);
    Serial.printf_P(PSTR("%s %d\n"), "Кол-во таймеров", Alarm.count());
}

void setup() {
    Serial.begin(115200);
    Serial.println();
    initRealTimeClock();
    initMediators();
    createDevicesAndScheduler();
    initDosersArray();
    if (!initWiFi()) {
        getParamsEEPROM();
    } else {
#ifdef ARDUINO_ARCH_ESP8266
        initHTTPClient();
#endif
        setInternalClock();
        // syncTime();
        postBoot();
        getParamsBackEnd();
        printParams();
    }

    startTimers();
    timer5();
}

void loop() {
    Alarm.delay(10);
}